app/controllers/posts_controller.rb

  def index
    @all_types = ['Shift', 'Ride', 'Other']
		if params.key?(:sort_by)
			session[:sort_by] = params[:sort_by]
		#elsif session.key?(:sort_by)
		#	redirect_to sort_by: session[:sort_by] and return
		end

		if params.key?(:types)
			session[:types] = params[:types]
		#elsif session.key?(:types)
		#	redirect_to types: session[:types] and return
		end

		@checked_types = (session[:types].keys if session.key?(:types)) || @all_types
    @posts = Post.where(thread_type: @checked_types).order(session[:sort_by])
---
SELECT "posts".* FROM "posts" WHERE "posts"."thread_type" IN ('Shift', 'Ride', 'Other') ORDER BY title