app/controllers/posts_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]
---
  def show
    id = params[:id] # retrieve movie ID from URI route
    @post = Post.find(id) # look up movie by unique ID

SELECT "posts".* FROM "posts" WHERE "posts"."type" IN ('Shift', 'Ride', 'Other') ORDER BY title
---
  def index
   @all_types = ['Shift', 'Ride', 'Other']
		if params.key?(:sort_by)
			session[:sort_by] = params[:sort_by]
		elsif session.key?(:sort_by)
			params[:sort_by] = session[:sort_by]
			redirect_to posts_path(params.permit(params.keys)) and return
			#:action, :commit, :controller, :sort_by, :types, :utf8, :post, :authenticity_token
		end

		if params.key?(:types)
			session[:types] = params[:types]
		elsif session.key?(:types)
			params[:types] = session[:types]
			redirect_to posts_path(params.permit(params.keys)) and return
		end


		@checked_types = (session[:types].keys if session.key?(:types)) || @all_types
    @posts = Post.where(type: @checked_types).order(session[:sort_by])

INSERT INTO "posts" ("title", "date", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "blah"], ["date", "2017-11-04 00:00:00"], ["created_at", "2017-11-04 04:10:13.366608"], ["updated_at", "2017-11-04 04:10:13.366608"]]
---
  def create
    @post = Post.create!(params[:post].permit(:title, :description, :type, :date))

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find params[:id]

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "thread_type" = ?, "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["thread_type", "Ride"], ["description", ""], ["updated_at", "2017-11-07 07:49:58.011541"], ["id", 1]]
---
  def update
    @post = Post.find params[:id]
    @post.update_attributes!(params[:post])